/*Реализуйте метод, проверяющий, является ли заданное число по абсолютной величине степенью двойки.

Решать можно разными способами:

воспользовавшись одним удобным статическим методом из класса java.lang.Integer;
применив пару трюков из двоичной арифметики;
написав решение "в лоб" с циклом и условными операторами (можете вернуться к этой задаче после просмотра
соответствующих уроков).
*/

package JavaMentor.Stepik;


public class PowerOfTwoRun {
    public static void main(String[] args) {

//        long l = Long.MAX_VALUE;
//        double d = Double.MAX_VALUE;
//        float f = Float.MAX_VALUE;


//        System.out.println(l > f);


//        System.out.println(0.1 + 0.1 + 0.1);

    }
}

//        System.out.println(isPowerOfTwo(-2));
//    }
//
//    private static boolean isPowerOfTwo(int value) {
//        value = Math.abs(value);
//
//        return Integer.bitCount(value) == 1;
//    }
//}

//        for (int i = 0; i < 32; i++) {
//            int a = 1 << i;
//            if (Math.abs(value) == a) {
//
//                return true;
//
////        return (Math.pow(2, value)) % 2 == 0;
//            }
//        }
//        return false;


//    private static int abs(int a) {
//        if (a < 0) {
//            return -a;
//        } else {
//            return a;
//        }
//
//    }
//}


//        return (abs(value) != 0) && ((abs(value) & (value-1)) == 0);
