package JavaMentor.apr29052019;


import java.util.Arrays;
import java.util.Collections;
import java.util.Scanner;

import java.math.*;

//1)Объяви переменные a,b типа int.
//        Сразу же в строке объявления присвой им разные значения.
//        Значениями могут быть любые целые числа.
//        Требования:
//        1.Объяви две переменные типа int.
//        2.Имена переменных должны быть a и b
//        3.Переменным сразу должны быть присвоены значения.
//        4.Переменные a и b должны иметь разные значения.
//@

//2)Объяви переменную name типа String.
//        Сразу же в строке объявления присвой ей какое-нибудь значение.
//        Выведи на экран переменную name.
//        Требования:
//        1.Объяви переменную типа String.
//        2.Имя переменной должно быть name
//        3.Переменной сразу должно быть присвоено значение.
//        4.Программа должна выводить текст на экран.
//        5.Выведенный текст должен быть значением переменной.
//@

//3)Решить циклом!
//        Напиши программу,которая выводит на экран надпись: «Хочешь-решай задачи,не хочешь-решай нехотя» 16раз.
//        Требования:
//        1.Программа должна выводить текст.
//        2.Текст должен начинаться с «Хочешь».
//        3.Текст должен заканчиваться на «нехотя».
//        4.Текст должен состоять из 16строк.
//        5.Выводимый текст должен соответствовать заданию.
//@

//4)Считаем длину окружности
//        Реализуй метод printCircleLength.Параметр метода-радиус окружности.Метод должен вывести на экран длину
//        окружности,рассчитанной по формуле:L=2*Pi*radius.Результат-дробное число(тип double).
//        В качестве значения Pi используй значение 3.14.
//        Требования:
//        1.В методе printCircleLength нужно вывести длину окружности,рассчитанной по формуле:2*Pi*radius.
//        2.Метод main должен вызывать метод printCircleLength с параметром 5.
//        3.Метод main не должен вызывать команду вывода текста на экран.
//        4.Программа должна выводить длину окружности с радиусом 5.
//@
//5)Метод convertCelsiumToFahrenheit(int celsium)принимает значение в градусах Цельсия.Метод должен переводить
// температуру и возвращать значение в градусах Фаренгейта.
//        Температура по Цельсию TC и температура по Фаренгейту TF связаны следующим соотношением:
//        TC=(TF – 32)*5/9.
//        TF = (TC * 9/5)+32
//        Пример:
//        В метод convertCelsiumToFahrenheit на вход подается значение 40.
//        Пример вывода:
//        104.0
//        Требования:
//        1.Метод convertCelsiumToFahrenheit(int)должен быть публичным и статическим.
//        2.Метод convertCelsiumToFahrenheit должен возвращать значение типа double.
//        3.Метод convertCelsiumToFahrenheit не должен ничего выводить на экран.
//        4.Метод convertCelsiumToFahrenheit должен правильно переводить градусы Цельсия в градусы Фаренгейта и
//        возвращать это число.
//@
//6)Реализуй метод getCountSecondsPassedInCurrentHour(int seconds).Метод на вход принимает целое число секунд,
// которые прошли с начала текущих суток.Нужно найти количество секунд,прошедших с начала последнего часа,и
// вернуть это число.
//        Пример:
//        Метод getCountSecondsPassedInCurrentHour вызывается с параметром 12345.
//        Пример вывода:
//        1545
//        Требования:
//        1.Метод getCountSecondsPassedInCurrentHour(int)должен быть публичным и статическим.
//        2.Метод getCountSecondsPassedInCurrentHour должен возвращать значение типа int.
//        3.Метод getCountSecondsPassedInCurrentHour не должен ничего выводить на экран.
//        4.Метод getCountSecondsPassedInCurrentHour должен правильно возвращать количество секунд,прошедших
//        с начала последнего часа.
//@

//7)Амиго,сегодня наша задача наполнить корабельный бассейн.Нужно посчитать,сколько литров воды нужно для заполнения
// бассейна до бортов.Известно,что бассейн имеет линейные размеры a х b x c,заданные в метрах.
//        Эти размеры передаются в метод getVolume.Метод должен вернуть количество литров воды,которое нужно для
//        наполнения бассейна.
//        Пример:
//        Метод getVolume вызывается с параметрами 25,5,2.
//        Пример вывода:
//        250000
//        Требования:
//        1.Метод getVolume(int,int,int)должен быть публичным и статическим.
//        2.Метод getVolume(int,int,int)должен возвращать значение типа long.
//        3.Метод getVolume(int,int,int)не должен ничего выводить на экран.
//        4.Метод
//        getVolume(int,int,int)должен правильно возвращать количество воды,которое необходимо для наполнения
//        бассейна в литрах.
//@

//8)Напиши программу,которая считывает с клавиатуры целое число a и выводит квадрат
//        этого числа(a*a).
//        Внимательно просмотри лекцию.Для считывания данных с клавиатуры используй метод nextInt()класса Scanner.
//        Требования:
//        1.Программа должна выводить текст.
//        2.В программе необходимо создать объект типа Scanner.
//        3.Программа должна считывать данные с клавиатуры.
//        4.Программа должна выводить квадрат считанного числа.
//@



public class test1 {
    public static void main(String[] args) {

//        int a = 5, b = 7;
//
//        String name = "John";
//
//        System.out.println(name);
//
//        String text = "«Хочешь-решай задачи,не хочешь-решай нехотя»";
//
//        for (int i = 0; i < 16; i++)
//            System.out.println(text);

//        double s = printCircleLength(5);
//        System.out.println(s);
//
//    }
//    private static double printCircleLength (double radius) {
//        double l = 2 * 3.14 * radius;
//        return l;
//    }

//        double resTemp = convertCelsiumToFahrenheit(40);
//        System.out.println(resTemp);
//
//    }
//    public static double convertCelsiumToFahrenheit(int celsium) {
//        double tf = (celsium * 9 / 5) + 32;
//        return tf;
//    }

//        int resSec = getCountSecondsPassedInCurrentHour(12345);
//        System.out.println(resSec);
//    }
//    public static int getCountSecondsPassedInCurrentHour(int seconds) {
//        int minH = seconds / 3600;
//        int h = seconds - (minH * 3600);
//        return  h;
//
//    }

//        long res = getVolume(25, 5, 2);
//        System.out.println(res);
//
//    }
//
//    public static long getVolume(int a, int b, int c) {
//        int v = (a * b * c) * 1000;
//        return v;
//    }
//}

//        System.out.print("Введите целое число: ");
//
//        Scanner scanner = new Scanner(System.in);
//        int num = scanner.nextInt();
//
//        System.out.println(num * num);




//9)Напиши программу,которая считывает с клавиатуры строку и выводит её на экран.Для этого воспользуйтесь классом
// Scanner(для чтение данных с клавиатуры).

        /*Задание:

        Создайте метод static int getMinFromTwo(int x, int y), который принимает два целочисленных параметра и возвращает
        наименьший из них.

        Создайте метод static int getMinFromFour(int x, int y, int m, int n), который принимает четыре целочисленных
        параметра и возвращает наименьший из них.

        При том второй метод должен использовать первый.

                Условия:

        Оба метода должны принимать целочисленные параметры
        Оба метода должны возвращать целочисленные параметры
        Второй метод должен использовать первый
        Методы не должны ничего выводить в консоль*/




    }

    static int getMinFromTwo(int x, int y){
        int min1 = Math.min(x, y);
        return min1;
    }

    static int getMinFromFour(int x, int y, int m, int n) {
        Integer [] num = {x, y, m, n};
        int min2 = Collections.min(Arrays.asList(num));
        return min2;
    }

}